#### Terraform Format and Style 🖌 `success`

#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/test-gh-actions/learn-terraform-github-actions/runs/run-FN3y15b9hA8DgmU3

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.host: Refreshing state... [id=static-site-cors-host-20250112213243806300000001]
aws_s3_bucket.frontend: Refreshing state... [id=static-site-frontend-20250112213243806600000002]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=static-site-frontend-20250112213243806600000002]
aws_s3_bucket_website_configuration.frontend: Refreshing state... [id=static-site-frontend-20250112213243806600000002]
aws_s3_bucket_policy.frontend: Refreshing state... [id=static-site-frontend-20250112213243806600000002]
aws_s3_bucket_public_access_block.host: Refreshing state... [id=static-site-cors-host-20250112213243806300000001]
aws_s3_bucket_cors_configuration.host: Refreshing state... [id=static-site-cors-host-20250112213243806300000001]
aws_s3_bucket_policy.host: Refreshing state... [id=static-site-cors-host-20250112213243806300000001]
aws_s3_object.frontend["video.html"]: Refreshing state... [id=video.html]
aws_s3_object.frontend["styles.css"]: Refreshing state... [id=styles.css]
aws_s3_object.frontend["error.html"]: Refreshing state... [id=error.html]
aws_s3_object.host["images/image-1.jpg"]: Refreshing state... [id=images/image-1.jpg]
aws_s3_object.host["images/image-2.jpg"]: Refreshing state... [id=images/image-2.jpg]
aws_s3_object.host["images/image-3.jpg"]: Refreshing state... [id=images/image-3.jpg]
data.template_file.frontend_index: Refreshing...
data.template_file.frontend_index: Refresh complete after 0s [id=98eda11082e3fc3a41a379adc25f4b798413e102d61f2c3af6cc0a3e89194f07]
aws_s3_object.frontend_index: Refreshing state... [id=index.html]
local_file.frontend_index: Refreshing state... [id=87e866cf096394963d3fd521d03ccffe4eda6423]
local_file.frontend_index: Drift detected (delete)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-FN3y15b9hA8DgmU3/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-FN3y15b9hA8DgmU3/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.frontend_index will be created
  + resource "local_file" "frontend_index" {
      + content              = <<-EOT
            <!-- index.html.tmpl -->
            <!DOCTYPE html>
            <html lang="en">
            <head>
              <meta charset="UTF-8">
              <meta name="viewport" content="width=device-width, initial-scale=1.0">
              <title>Rob's Future Side Hustle</title>
              <link rel="stylesheet" href="styles.css">
            </head>
            <body>
              <header>
                <h1>Welcome to Rob's Future Side Hustle!</h1>
              </header>
              <main>
                <div class="gallery">
                  <img src="https://static-site-cors-host-20250112213243806300000001.s3.us-east-1.amazonaws.com/images/image-1.jpg" alt="Hostess Image 1">
                  <img src="https://static-site-cors-host-20250112213243806300000001.s3.us-east-1.amazonaws.com/images/image-2.jpg" alt="Hostess Image 2">
                  <img src="https://static-site-cors-host-20250112213243806300000001.s3.us-east-1.amazonaws.com/images/image-3.jpg" alt="Hostess Image 3">
                </div>
                <section>
                  <h2>For Theo</h2>
                  <nav>
                    <a href="/video.html">Theo's Video</a>
                  </nav>
                </section>
              </main>
              <footer>
                <p>Image Gallery Landing Page</p>
              </footer>
            </body>
            </html>
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./test-index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @aaron-dm-mcdonald, Action: `pull_request`*